LES/3DJet_twoLiquidMixingFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoLiquidMixingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         800;

deltaT          1e-3;

writeControl    timeStep;

writeInterval   500; // every 0.5s

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


maxCo           0.5;

maxAlphaCo      0.5;

// ************************************************************************* //
