LES/3DJet_twoLiquidMixingFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1; // Set scale to 1 for normal sizing (no scaling)

vertices
(
(-2 -2 0)
(2 -2 0)
(2 2 0)
(-2 2 0)
(-2 -2 20)
(2 -2 20)
(2 2 20)
(-2 2 20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 100) simpleGrading (1 1 1) // Reduced cell count
);

edges
(
);

boundary
(
    ambient
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
