LES/3DJet_twoLiquidMixingFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.wastewater.*"
    {
        nAlphaSubCycles     2;
        nAlphaCorr          1;

        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-9;
        relTol          0;
        nSweeps         1;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-20;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    };
    "(U|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       0;
        relTol          0.1;
    }

    "(U|nuTilda)Final"
    {
        $U;
        tolerance        1e-6;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;

    pRefValue           0;
    pRefPoint           (0.1 0.1 1);
}


// ************************************************************************* //
